In [1]:
import pandas as pd
import numpy as np

In [3]:
sozlukVerisi ={"istanbul":[30,29,np.nan],"ankara":[20,np.nan,25],"izmir":[40,39,38]}
havaDurumuDataFrame= pd.DataFrame(sozlukVerisi)

In [4]:
havaDurumuDataFrame

   istanbul  ankara  izmir
0      30.0    20.0     40
1      29.0     NaN     39
2       NaN    25.0     38

In [5]:
havaDurumuDataFrame.dropna()  #nan değerini düşürmek için kullanılır

   istanbul  ankara  izmir
0      30.0    20.0     40

In [6]:
havaDurumuDataFrame

   istanbul  ankara  izmir
0      30.0    20.0     40
1      29.0     NaN     39
2       NaN    25.0     38

In [10]:
havaDurumuDataFrame.dropna(axis=1)

   izmir
0     40
1     39
2     38

In [11]:
yeniVeri ={"istanbul":[30,29,np.nan],"ankara":[20,np.nan,25],"izmir":[40,39,38],"antalya":[45,np.nan,np.nan]}

In [12]:
yeniDataFrame= pd.DataFrame(yeniVeri)

In [13]:
yeniDataFrame

   istanbul  ankara  izmir  antalya
0      30.0    20.0     40     45.0
1      29.0     NaN     39      NaN
2       NaN    25.0     38      NaN

In [15]:
yeniDataFrame.dropna(axis=1, thresh=2)  #thresh limit koymak için kullanılır.

   istanbul  ankara  izmir
0      30.0    20.0     40
1      29.0     NaN     39
2       NaN    25.0     38

In [17]:
yeniDataFrame.fillna(20)  #fillna nan değerlerini parametrenin içerisine hangi değer yazılı ise nan değerlerine onu yazdırır.

   istanbul  ankara  izmir  antalya
0      30.0    20.0     40     45.0
1      29.0    20.0     39     20.0
2      20.0    25.0     38     20.0

## GroupBy

In [18]:
maasSozlugu={"departman":["yazılım","yazılım","pazarlama","pazarlama","hukuk","hukuk"],
             "calisan ismi":["ahmet","mehmet","atil","burak","zehra","betül"],
            "maas":[100,150,200,250,300,350]}

In [19]:
maasDataFrame=pd.DataFrame(maasSozlugu)

In [20]:
maasDataFrame

   departman calisan ismi  maas
0    yazılım        ahmet   100
1    yazılım       mehmet   150
2  pazarlama         atil   200
3  pazarlama        burak   250
4      hukuk        zehra   300
5      hukuk        betül   350

In [23]:
groupObjesi= maasDataFrame.groupby("departman")

In [24]:
groupObjesi

In [25]:
groupObjesi.count()

           calisan ismi  maas
departman
hukuk                 2     2
pazarlama             2     2
yazılım               2     2

In [26]:
groupObjesi.mean()

           maas
departman
hukuk       325
pazarlama   225
yazılım     125

In [27]:
groupObjesi.describe()

           maas
          count   mean        std    min    25%    50%    75%    max
departman
hukuk       2.0  325.0  35.355339  300.0  312.5  325.0  337.5  350.0
pazarlama   2.0  225.0  35.355339  200.0  212.5  225.0  237.5  250.0
yazılım     2.0  125.0  35.355339  100.0  112.5  125.0  137.5  150.0